# Задача 18:
# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь вводит натуральное число N – количество элементов в массиве и число, которое необходимо проверить - X.

# Заполните массив случайными натуральными числами от 1 до N.
# Выведите, ближайший к X элемент. Если есть несколько элементов, которые равноудалены от X, выведите наименьший по
# величине.

# Ввод: 10
# Ввод: 7
# 1 2 1 8 9 6 5 4 3 4
# Вывод: 6

from random import randint

n = input("Пожалуйста, введите количество элементов списка: ")
x = input("Пожалуста, введите искомый элемент: ")
try:
    n = int(n)
    x = int(x)
    if (n <= 0) or (x <= 0):
        print("Пожалуйста, введите натуральные параметры (Целые числа больше 1)")
    else:
        myList = []
        for i in range(0, n):
            myList.append(randint(1, n))
        print(myList)
        if n % 2 == 0:
            length = n // 2
        else:
            length = n // 2 + 1
        result = 0
        is_find = False
        for i in range(1, length):
            if myList.count(x - i) > 0:
                result = x - i
                is_find = True
                break
            elif myList.count(x + i) > 0:
                result = x + i
                is_find = True
                break
        if is_find:
            print(f"Ближайший по значению к {x} элемент равен {result}")
        else:
            print("Все элементы массива равны")
except ValueError:
    print("Пожалуйста введите параметры в числовом виде!!!")
