# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь вводит натуральное число N – количество элементов в массиве и число, которое необходимо проверить - X.
# Заполните массив случайными натуральными числами от 1 до N/2.
# Выведите, сколько раз X встречается в массиве.

# Ввод: 5
# Ввод: 1

# 1 2 1 2 2
# Вывод: 2

from random import randint

n = input("Пожалуйста, введите количество элементов списка: ")
x = input("Пожалуста, введите искомый элемент: ")
try:
    n = int(n)
    x = int(x)
    if (n <= 0) or (x <= 0):
        print("Пожалуйста, введите натуральные параметры (Целые числа больше 1)")
    else:
        myList = []
        for i in range(0, n):
            myList.append(randint(1, n // 2))
        print(myList)
        if myList.count(x) % 100 >= 12 and myList.count(x) % 100 <= 14:
            word = "раз"
        elif myList.count(x) % 10 >= 2 and myList.count(x) % 10 <= 4:
            word = "раза"
        else:
            word = "раз"
        print(f"Элемент {x} повторяется в списке {myList.count(x)} {word}")
except ValueError:
    "Пожалуйста введите параметры в числовом виде!!!"
