# Задача 4
# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

sum = input("Пожалуйста, введите количество журавликов: ")
try:
    sum = int(sum)
except ValueError:
    print("Пожалуйста введите данные в числовом формате!!!")
if (sum%4==0):
    katyas_count = int(sum/2)
    petyas_count = int(sum/4)
    print(f"Катя сделала {katyas_count} журавликов, а Петя и Сережа по {petyas_count} журавликов")
else:
    print("Количество не соответствует условию задачи. Пожалуйста, введите количество кратное 4")
 