# Задача 6
# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

number = input("Пожалуйста, введите шестизначный номер билета: ")
try:
    number = int(number)
    if number < 0:
        print("Номер билета не может быть отрицательным!")
    elif number < 1000000 and number >= 100000:
        sum1 = number // 1000 // 10 // 10 + number // 1000 // 10 % 10 + number // 1000 % 10
        sum2 = number % 1000 // 10 // 10 + number % 1000 // 10 % 10 + number % 1000 % 10
        if sum2 == sum1:
            print("УРА!!! У вас счастливый билетик!!!!")
        else:
            print("Жаль, но билетик не счастливый. Может повезет в другой раз )))")
    else:
        print("Номер билета должен быть шестизначный!!!! Пожалуйста, повторите попытку.")
except ValueError:
    print("Пожалуйста введите данные в числовом формате!!!")

