# Задача 4
# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

sum = input("Пожалуйста, введите количество журавликов: ")
try:
    sum = int(sum)
    if sum > 0 and sum % 4 == 0:
        katyas_count = int(sum / 2)
        petyas_count = int(sum / 4)
        print(f"Катя сделала {katyas_count} журавликов, а Петя и Сережа по {petyas_count} журавликов")
    else:
        print("Количество не соответствует условию задачи. Пожалуйста, введите натуральное количество журавликов кратное 4")
except ValueError:
    print("Пожалуйста введите данные в числовом формате!!!")
