# Задача 22:
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа.
# n - кол-во элементов первого набора.
# m - кол-во элементов второго набора.
# Значения генерируются случайным образом.

from random import randint

def init_list (number):
    my_list = []
    for i in range(number):
        my_list.append(randint(0,99))
    return my_list


n = input('Пожалуйста, введите количество элементов 1 списка: ')
m = input('Пожалуйста, введите количество элементов 2 списка: ')
if n.isdigit() and m.isdigit():
    if int(n)>0 and int(m)>0:
        n = int(n)
        m = int(m)
        list1 = init_list(n)
        list2 = init_list(m)
        print("Набор 1:")
        print(list1, sep=', ')
        print("Набор 2:")
        print(list2, sep=', ')
        print("В обоих наборах встречаются следующие элементы:")
        result = sorted(set.intersection(set(list1),set(list2)))
        print(result, sep=", ")
    else:
        print("Количество элементов должно быть натуральным числом (больше 0)")
else:
    print("Пожалуйста, введите количество элементов списка в числовом формате! Числа должны быть целыми!")
    

